{
  "basics": {
    "name": "Josh Holloway",
    "label": "Engineer",
    "email": "imjoshholloway@gmail.com",
    "phone": "+447934273967",
    "website": "https://imjoshholloway.uk",
    "summary": "I'm an experienced engineer with a proven track record of designing and delivering solutions for a variety of problem spaces. Currently focused on automation but also open to more product focused roles.",
    "location": {
      "city": "Andover",
      "countryCode": "UK",
      "region": "Hampshire"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "imjoshholloway",
        "url": "https://twitter.com/imjoshholloway"
      },
      {
        "network": "Linkedin",
        "username": "imjoshholloway",
        "url": "https://www.linkedin.com/in/imjoshholloway"
      }
    ]
  },
  "work": [
    {
      "company": "Splunk",
      "position": "Engineering Manager",
      "startDate": "2019-04-01",
      "summary": "Building and leading teams to create services and tooling to make operating Splunk>Cloud more efficent.",
      "highlights": [
        "Architecting internal platform to unify how cloud services are provisioned and managed. Created kubernetes operators to abstract the underlying implementation details to provide consistent interface for developers and operations",
        "Working with Director and peers to provide a clear vision and roadmpa of the offerings within the organization",
        "Evaluating and prioritising stakeholder requirements from across the business",
        "Mentoring engineers to help them grow, both as individuals and as part of the team",
        "Presenting the technical vision and roadmap to various levels of the business"
      ]
    },
    {
      "company": "Splunk",
      "position": "Principal Site Reliability Engineer",
      "startDate": "2017-09-01",
      "endDate": "2019-04-01",
      "summary": "Leading a team in delivering an automation platform to replace existing provisioning systems reponsible for managing Splunk>Cloud",
      "highlights": [
        "Architecting automation platform designed to scale across multiple cloud providers and manage the entire lifecylce of customer environments",
        "Utilizing automation and resiliant design to make all aspects of the infrastructure fully replaceable",
        "Leading a team of geographically distributed remote workers",
        "Driving technical discussions to ensure the right solution is chosen",
        "Working with product focused teams to ensure features follow cloud best practices"
      ]
    },
    {
      "company": "Splunk",
      "position": "Site Reliability Engineer",
      "startDate": "2016-09-01",
      "endDate": "2017-09-01",
      "summary": "Building and maintaining the automation and configuration management systems responsible for Splunk>Cloud. Orchestrating the provisioning of AWS infrastructure, debugging issues with Splunk and Linux. Performing upgrades, scaling and maintenance on multi-terrabyte Splunk clusters. Coaching other members of the team in automation best practices and DevOps philosophies",
      "highlights": [
        "Reduced manual intervention required by other team members when replacing failing infrastructure using AWS Lambda and Cloudwatch Events",
        "Improved reliability of Ansible playbooks by writing deterministic and easy to read Ansible roles"
      ]
    },
    {
      "company": "Hailo",
      "position": "Platform Engineer",
      "startDate": "2015-09-01",
      "endDate": "2016-09-01",
      "summary": "Developing and maintaining highly available, distributed systems on top of an in house Golang based microservice platform. Peer reviewing code. Identifying and fixing performance bottlenecks/poorly designed code. Automating infrastructure changes through the use of tools such as Puppet and Terraform. Maintaining existing shared infrastructure (Cassandra, RabbitMQ, Zookeeper) and investigating new technologies (Docker, Consul, Kubernetes)",
      "highlights": [
        "Refactored underlying Golang framework; removing inefficent calls to core services, increasing reslience to failure and improving uptime",
        "Replaced Jenkins with CircleCI. - Reducing costs and improving developer efficency",
        "Refactored Puppet repository, removing over 65,000 lines of unnecessary code without any breaking changes",
        "Used Docker to give developers the ability to setup their entire development environment in 1 command"
      ]
    },
    {
      "company": "Threadster Ltd",
      "position": "Software Developer",
      "website": "",
      "startDate": "2014-06-01",
      "endDate": "2015-08-01",
      "summary": "Designing and developing an microservice based e-commerce platform using a mixture of technologies including Node.js, Golang, Docker, RabbitMQ and PostgreSQL. Integrating with multiple third party APIs (payment providers, shipping service providers).",
      "highlights": [
        "Built a fully automated CI/CD pipeline using Jenkins CI",
        "Automated label printing, increasing efficency and reducing number of incorrectly labeled / shipped orders almost zero"
      ]
    },
    {
      "company": "Calls2Account",
      "position": "Software Developer",
      "startDate": "2012-01-01",
      "endDate": "2014-06-01",
      "summary": "Developing and maintaining custom software applications at all levels of the system. Designing and documenting solutions (for distribution both internally and to clients) Maintaining both MySQL and MongoDB databases. Designing database schemas; both normalised and denormalised. Maintaining and supporting legacy applications built in a variety of programming languages, including; PHP, .NET 2.0 and Adobe Flex. Setting up testing environments and performing regression testing and UAT's",
      "highlights": [
        "Replaced legacy Adobe Flex based UI with current generation HTML/JavaScript based ones",
        "Spent time on client site in Italy to assist in debugging issues with their platform when receiving responses to API calls. Successfully finding the cause and helping implement fix",
        "Lead research into new class of services using node.js. Prototyped replacement of legacy CDR processor (written in .NET) with node.js based version"
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "keywords": [
        "Golang",
        "Python",
        "Javascript",
        "node.js",
        "HTML / CSS"
      ]
    },
    {
      "name": "Orchestration / Provisioning Tools",
      "keywords": [
        "Puppet",
        "Ansible",
        "Packer",
        "Terraform",
        "CloudFormation",
        "Kubernetes"
      ]
    },
    {
      "name": "Databases",
      "keywords": [
        "Cassandra",
        "MySQL",
        "PostgreSQL",
        "MongoDB",
        "DynamoDB"
      ]
    },
    {
      "name": "Other Technologies",
      "keywords": [
        "Splunk",
        "RabbitMQ",
        "NSQ",
        "Jenkins",
        "CircleCI",
        "AWS",
        "Docker"
      ]
    }
  ],
  "interests": [
    {
      "name": "Sports",
      "keywords": ["Football", "Golf", "Cycling"]
    },
    {
      "name": "Technologies",
      "keywords": ["Distributed-systems", "Microservices", "Docker", "CoreOS", "Kubernetes"]
    }
  ]
}
